# Eksik veri işlemleri:
- None: Verinin olmadığını söyler.
- NaN: Not a Number: Verinin eksik olduğunu söyler.
- Null: Verinin olmadığını söyler. Pythonda kullanılmaz.

In [4]:
#Kütüphanelerin çağırılması:
import numpy as np
import pandas as pd

In [5]:
type(None)

NoneType

In [6]:
type(np.NaN)

float

In [7]:
#None + 1
#Hata verdi

In [8]:
np.nan + 1

nan

In [9]:
eksik_veri_serisi = pd.Series(data = np.array([None,np.nan,1,"merhaba",2]))

In [10]:
eksik_veri_serisi

0       None
1        NaN
2          1
3    merhaba
4          2
dtype: object

# Eksik verilerin tespiti
- isnull(): eksik verinin olduğu yerleri True olarak gönderir.
- isna(): isnull() ile benzer iş yapar.
- notnull(): eksik verinin olduğu yerleri False olarak gönderir.

In [11]:
eksik_veri_serisi.isna()

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [12]:
eksik_veri_serisi.isnull().sum() #eksik veri sayısını topladık.

2

In [13]:
#eksik verileri gösterme
#aşağıdaki şekilde boş olan verileri filtreledik8
eksik_veri_serisi[eksik_veri_serisi.isnull()]

0    None
1     NaN
dtype: object

# Eksik verilerle ilgilenelim
1. eksik verilerin göz ardı edilmesi
- dropna(): eksik verileri düşürür. doldurma yapmadan düşürmeye yarar.
2. eksik verilerin doldurulması
- fillna(): eksik verileri doldurmak için kullanılır.
- inplace parametresi, yapılan değişikliğin kalıcılığını belirler. varsayılan değeri false'tur.
bu değeri true olarak değiştirdiğimiz takdirde, yaptığımız değişiklikler kalıcı olurlar.
bu durum pek tavsiye edilen bir şey değildir.
- limit parametresi ile baştan başlayarak kaç adet boş değerin doldurulacağının sayısı verilebilir.

In [14]:
eksik_veri_serisi.dropna()

2          1
3    merhaba
4          2
dtype: object

In [15]:
eksik_veri_serisi.fillna(value = -1)

0         -1
1         -1
2          1
3    merhaba
4          2
dtype: object

# Bir veri seti üzerinde çalışalım.
[veri seti linki](https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv) buradadır.

In [16]:
veri_seti = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [17]:
veri_seti.head() #veri setinin ilk beş satırını gösterir. doğruluğunu kontrol etmek için yaptık.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
veri_seti.tail() #veri setinin son beş satırını gösterir.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [19]:
veri_seti

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
veri_seti.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
veri_seti.Age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [22]:
veri_seti.Cabin.value_counts()

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: Cabin, Length: 147, dtype: int64

In [23]:
veri_seti.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [24]:
#eksik verileri dolduralım
veri_seti.fillna(value=-1).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,-1,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,-1,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,-1,S

In [25]:
veri_seti.fillna(value=-1).to_csv("eksi_birle_dolduruldu.csv")

In [26]:
#belirli sütunları dolduralım:
veri_seti.fillna({'Cabin':'0','Age':'-1'}).tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,-1,1,2,W./C. 6607,23.45,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,0,Q

In [27]:
veri_seti.fillna(method='bfill').to_csv("sonraki_ile_dolduruldu.csv")

In [28]:
veri_seti.fillna(method='bfill',limit=1).to_csv("sonraki_ile_dolduruldu_limit_1.csv")

In [29]:
#axis=0 satırlar için, axis=1 sütunlar için kullanılır.
#yaptığımız örnekte bir önceki sütundaki verinin değeri kullanılacak
veri_seti.fillna(method='ffill',axis="columns")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,7.25,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,7.925,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,8.05,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,13.0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,female,1,2,W./C. 6607,23.45,23.45,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,7.75,Q

In [30]:
veri_seti.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [31]:
#age sütunundaki boşlukları interpolate ile dolduralım.
#enterpolasyon yöntemi iki değer arasındaki boş değeri, o değerlerin ortalaması ile doldurulması yöntemidir.
#888. satır boştu. değişme bak.
veri_seti.Age.interpolate().tail()

886    27.0
887    19.0
888    22.5
889    26.0
890    32.0
Name: Age, dtype: float64

In [32]:
#index değeri boşluklar arasında eşit uzaklıkta olmayan değerleri yakın olan değere daha yakın uzak olan değere daha uzak vermesini sağlar.
veri_seti.Age.interpolate(method='index').to_csv('interpole_ile_dolduruldu_method_index')

In [33]:
#dropna() fonksiyonunda how parametresi verilerin nasıl silineceğini gösterir.
#varsayılan değeri any'dir. yani herhangi bir satırda herhangi bir veri eksikse siler.
#bunu all ile değiştirebiliriz. yani bir satırdaki bütün değerler boşsa siler.
#thresh parametresi verilen değere göre silme işlemi yapar.
#yani mesela 3 değeri verdiğimizde 3 tane dolu sütunu varsa silme demiş oluruz.
#subset parametresi sadece verdiğimiz diziyi düşürmeye yarar.
veri_seti.shape

(891, 12)

In [34]:
veri_seti.dropna().shape

(183, 12)

In [35]:
veri_seti.dropna(how='all').shape

(891, 12)

In [36]:
veri_seti.dropna(thresh=11).shape

(733, 12)

In [37]:
veri_seti.dropna(subset=['Cabin']).isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            19
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin           0
Embarked        2
dtype: int64